In [83]:
# Import needed libraries and load cleaned data for feature engineering
import sys
notebook_path = sys.path.append(r'e:\Data science\Titanic dataset\notebooks')

from auto_imports import *

df = pd.read_csv('E:\Data science\Titanic dataset\data\Processed data\Data Analysis\cleaned data.csv')

### Feature engineering

This notebook extracts new features from the Titanic dataset, such as splitting the Cabin, Name, and Ticket columns into more informative components.

In [84]:
# Show first rows of dataframe to understand the structure
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ind
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,C23 C25 C27,S,train
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,train
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C23 C25 C27,S,train
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,train
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,C23 C25 C27,S,train

#### Cabin Feature Engineering

Split the Cabin column into two new features: cabin cell number and cabin letter.

In [85]:
# Show Cabin column values for inspection
df['Cabin']

0       C23 C25 C27
1               C85
2       C23 C25 C27
3              C123
4       C23 C25 C27
           ...
1304    C23 C25 C27
1305           C105
1306    C23 C25 C27
1307    C23 C25 C27
1308    C23 C25 C27
Name: Cabin, Length: 1309, dtype: object

In [89]:
# Function to remove duplicate letters from cabin string
def remove_duplicate_letters(text):
        seen = set()
        result = ''
        for char in text:
            if char not in seen:
                seen.add(char)
                result += char
        return result.strip().replace(' ' , '-')

# Splitting cabin column to cell number and cabin letter
cell_number_count = df['Cabin'].replace(r'[a-zA-Z]' , '' , regex =True).str.strip().str.split().str.len()
print(cell_number_count.head())
df['cell_number_count'] = cell_number_count
df['Cabin_letter'] = df['Cabin'].replace(r'[0-9]' , '' , regex = True).apply(remove_duplicate_letters)
# When removing digits from cabin column values output may be like that (B B B B) so I made a function to remove these duplicated letters

0    3
1    1
2    3
3    1
4    3
Name: Cabin, dtype: int64

In [91]:
# Show unique cabin letters to check extraction
df['Cabin_letter'].unique()

array(['C', 'E', 'G', 'D', 'A', 'B', 'F', 'F-G', 'F-E', 'T'], dtype=object)

In [93]:
# Show unique cell numbers to check extraction
df['cell_number_count'].unique()

array([3, 1, 2, 0, 4])

In [95]:
# Count missing cell numbers
df['cell_number_count'].isna().sum()

np.int64(0)

In [96]:
# Drop Cabin column after splitting
df.drop('Cabin' , axis =1 , inplace=True)

In [97]:
# Show first rows after cabin processing
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,ind,cell_number_count,Cabin_letter
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,train,3,C
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,train,1,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S,train,3,C
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S,train,1,C
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S,train,3,C

#### Name Feature Engineering

Extract family name and title from the Name column, then drop the original Name column.

In [98]:
# Show first name value for inspection
df['Name'][0]

'Braund, Mr. Owen Harris'

- Extract family name from the first word and title from the second word in the Name column.
- Check for names with brackets, which may indicate maiden names or nicknames.

#### Title Extraction

Extract titles from the Name column for further analysis.

In [102]:
# Show value counts of titles extracted from Name
titles = df['Name'].str.split(r'[,.]').str[1].str.strip()
titles.value_counts()

Name
Mr              757
Miss            260
Mrs             197
Master           61
Rev               8
Dr                8
Col               4
Major             2
Mlle              2
Ms                2
Mme               1
Don               1
Sir               1
Lady              1
Capt              1
the Countess      1
Jonkheer          1
Dona              1
Name: count, dtype: int64

In [109]:
# Ok there are many titles so I will combine rare titles in new category called others
others = titles.value_counts()[titles.value_counts() < 61]
titles = titles.replace(others.index , 'Others') # replace all titles are less than 61

titles.value_counts()

Name
Mr        757
Miss      260
Mrs       197
Master     61
Others     34
Name: count, dtype: int64

In [ ]:
# Extract Title from Name
df['Title'] = titles

#### Extracting family size and  is Alone or not

In [ ]:
familysize =  df['Parch'] + df['SibSp'] # family size from this feature I will get is alone or not

df['FamilySize'] = familysize
df['Is Alone'] = (df['FamilySize'] == 0).astype(int) # if family size is 0 that means he/she is alone

In [ ]:
df.drop('Name' , axis = 1 , inplace=True)

In [ ]:
# Show first rows after name processing
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,ind,cell_number,Cabin_letter,Title,FamilySize,Is Alone
0,1,0.0,3,male,22.0,1,0,A/5 21171,7.2500,S,train,23-25-27,C,Mr,1,0
1,2,1.0,1,female,38.0,1,0,PC 17599,71.2833,C,train,85,C,Mrs,1,0
2,3,1.0,3,female,26.0,0,0,STON/O2. 3101282,7.9250,S,train,23-25-27,C,Miss,0,1
3,4,1.0,1,female,35.0,1,0,113803,53.1000,S,train,123,C,Mrs,1,0
4,5,0.0,3,male,35.0,0,0,373450,8.0500,S,train,23-25-27,C,Mr,0,1

#### Ticket Feature Engineering

Extract special agent/route, ticket batch, and shared ticket indicators from the Ticket column.

In [ ]:
# Split Ticket column for further processing
df['Ticket'].str.split()

0                [A/5, 21171]
1                 [PC, 17599]
2         [STON/O2., 3101282]
3                    [113803]
4                    [373450]
                ...
1304             [A.5., 3236]
1305              [PC, 17758]
1306    [SOTON/O.Q., 3101262]
1307                 [359309]
1308                   [2668]
Name: Ticket, Length: 1309, dtype: object

In [ ]:
# Extract special agent/route from Ticket
clean_agents = df['Ticket'].str.extract(r'^([A-Za-z/.]+\d*)', expand=False).fillna('Non-special').replace('[.]' , '' , regex=True)

In [ ]:
# Show unique special agent/route values
clean_agents.unique()

# That's perfect

array(['A/5', 'PC', 'STON/O2', 'Non-special', 'PP', 'CA', 'SC/Paris',
       'SC/A4', 'A/4', 'SP', 'SOC', 'SO/C', 'W/C', 'SOTON/OQ', 'WEP',
       'STON/O', 'A4', 'C', 'SC/PARIS', 'SOP', 'A5', 'Fa', 'LINE', 'FCC',
       'SW/PP', 'SCO/W', 'P/PP', 'SC', 'SC/AH', 'A/S', 'WE/P', 'SO/PP',
       'FC', 'SOTON/O2', 'CA/SOTON', 'SC/A3', 'STON/OQ', 'AQ/4', 'A',
       'LP', 'AQ/3'], dtype=object)

In [ ]:
# Add special agent/route column
df['Special Agent/route'] = clean_agents

Create a TicketBatch column to indicate early or late ticket batches based on ticket digit length.

In [ ]:
# Extract ticket digits for batch classification
ticket_digits = df['Ticket'].str.split().str[-1]
ticket_digits.str.len().unique()

array([5, 7, 6, 4, 3, 1])

In [ ]:
# Show ticket digits with length 1 for correction
ticket_digits[ticket_digits.str.len() == 1]

772     3
841     3
1077    2
1193    2
Name: Ticket, dtype: object

In [ ]:
# Get corrected values for tickets with length 1
corrected_values = df.iloc[ticket_digits[ticket_digits.str.len() == 1].index]['Ticket'].values
corrected_values

array(['S.O./P.P. 3', 'S.O./P.P. 3', 'S.O./P.P. 2', 'S.O./P.P. 2'],
      dtype=object)

In [ ]:
# Assign corrected values to ticket_digits
ticket_digits[ticket_digits.str.len() == 1] = corrected_values

In [ ]:
# Check unique lengths after correction
ticket_digits.str.len().unique()

array([ 5,  7,  6,  4,  3, 11])

In [ ]:
# Show unique ticket digits
ticket_digits.unique()

array(['21171', '17599', '3101282', '113803', '373450', '330877', '17463',
       '349909', '347742', '237736', '9549', '113783', '2151', '347082',
       '350406', '248706', '382652', '244373', '345763', '2649', '239865',
       '248698', '330923', '113788', '347077', '2631', '19950', '330959',
       '349216', '17601', '17569', '335677', '24579', '17604', '113789',
       '2677', '2152', '345764', '2651', '7546', '11668', '349253',
       '2123', '330958', '23567', '370371', '14311', '2662', '349237',
       '3101295', '39886', '17572', '2926', '113509', '19947', '31026',
       '2697', '34651', '2144', '2669', '113572', '36973', '347088',
       '17605', '2661', '29395', '3464', '3101281', '315151', '33111',
       '14879', '2680', '1601', '348123', '349208', '374746', '248738',
       '364516', '345767', '345779', '330932', '113059', '14885',
       '3101278', '6608', '392086', '343275', '343276', '347466', '5734',
       '2315', '364500', '374910', '17754', '17759', '231919', '244367',
       '349245', '349215', '35281', '7540', '3101276', '349207', '343120',
       '312991', '349249', '371110', '110465', '2665', '324669', '4136',
       '2627', '3101294', '370369', '17558', '54510', '27267', '370372',
       '17369', '2668', '347061', '349241', '3101307', '3337', '228414',
       '29178', '2133', '11752', '7534', '17593', '2678', '347081',
       '3101279', '365222', '231945', '33112', '350043', '230080',
       '244310', '1166', '113776', '11206', '851', '265302', '17597',
       '35851', '392090', '315037', '2343', '371362', '33595', '347068',
       '315093', '363291', '113505', '17318', '111240', '3101280',
       '17764', '350404', '4133', '17595', '250653', 'LINE', '2131',
       '230136', '315153', '113767', '370365', '111428', '364849',
       '349247', '234604', '28424', '350046', '17610', '368703', '4579',
       '370370', '248747', '345770', '3101264', '2628', '3540', '347054',
       '2699', '367231', '112277', '3101311', '13528', '21174', '250646',
       '367229', '35273', '3101283', '243847', '11813', '14208', '392089',
       '220367', '21440', '349234', '19943', '4348', '751', '21173',
       '236171', '347067', '237442', '29566', '6609', '26707', '31921',
       '28665', '1585', '367230', '14263', '3101275', '2694', '19928',
       '347071', '250649', '11751', '244252', '362316', '113514', '3336',
       '370129', '2650', '17585', '110152', '17755', '230433', '384461',
       '110413', '112059', '382649', '17248', '347083', '17582', '17760',
       '113798', '250644', '17596', '370375', '13502', '347073', '239853',
       '2673', '336439', '347464', '345778', '10482', '113056', '349239',
       '345774', '349206', '237798', '370373', '19877', '11967', '2163',
       '349236', '349233', '17612', '2693', '113781', '19988', '9234',
       '367226', '226593', '2466', '17421', '17758', '3381', '17485',
       '11767', '17608', '250651', '349243', '13529', '347470', '29011',
       '36928', '16966', '21172', '349219', '234818', '345364', '28551',
       '111361', '113043', '17611', '349225', '7598', '113784', '248740',
       '244361', '229236', '248733', '31418', '386525', '37671', '315088',
       '7267', '113510', '2695', '2647', '345783', '237671', '330931',
       '330980', '2167', '2691', '3101310', '7076', '110813', '2626',
       '14313', '17477', '11765', '3101267', '323951', '7077', '113503',
       '2648', '347069', '17757', '2653', '3101293', '349227', '27849',
       '367655', '1748', '113760', '350034', '3101277', '350052',
       '350407', '28403', '244278', '240929', '3101289', '341826', '4137',
       '315096', '28664', '347064', '29106', '312992', '349222', '394140',
       '3101269', '343095', '28220', '250652', '28228', '345773',
       '349254', '13032', '315082', '347080', '34244', '2003', '250655',
       '364851', '392078', '110564', '376564', '3085', '3101274', '13507',
       '18723', '345769', '347076', '230434', '65306', '33638', '113794',
       '2666', '113786', '65303', '113051', '17453', '2817', '349240',
       '13509', '17464', '13531', '371060', '19952', '364506', '111320',
       '234360', '2816', '3101306', '113792', '36209', '323592', '315089',
       '541', '7553', '31027', '3460', '350060', '3101298', '239854',
       '3594', '4134', '11771', '18509', '65304', '3101317', '113787',
       '17609', '45380', '36947', '6212', '350035', '315086', '364846',
       '330909', '4135', '26360', '111427', '4001', '382651', '3101316',
       '17473', '17603', '349209', '36967', '34260', '226875', '349242',
       '12749', '349252', '2624', '2700', '367232', '14258', '17483',
       '3101296', '29104', '2641', '2690', '315084', '113050', '17761',
       '364498', '13568', '5735', '2908', '693', '2146', '244358',
       '330979', '2620', '347085', '113807', '11755', '345572', '372622',
       '349251', '218629', '392082', '392087', '48871', '349205', '2686',
       '350417', '752', '11769', '17474', '14312', '20589', '358585',
       '243880', '2689', '3101286', '237789', '13049', '3411', '237565',
       '13567', '14973', '3235', '3101273', '3902', '364848', '29037',
       '248727', '2664', '349214', '113796', '364511', '111426', '349910',
       '349246', '113804', '3101305', '370377', '364512', '220845',
       '31028', '2659', '11753', '350029', '54636', '36963', '219533',
       '349224', '334912', '27042', '347743', '13214', '112052', '237668',
       '3101292', '350050', '349231', '13213', '2314', '349221', '8475',
       '330919', '365226', '349223', '29751', '2623', '5727', '349210',
       '3101285', '234686', '312993', '3536', '19996', '29750', '12750',
       '24580', '244270', '239856', '349912', '342826', '4138', '330935',
       '6563', '349228', '350036', '24160', '349256', '2672', '113800',
       '248731', '363592', '35852', '348121', '17475', '36864', '350025',
       '223596', '17476', '17482', '113028', '7545', '250647', '348124',
       '34218', '36568', '347062', '350048', '12233', '250643', '113806',
       '315094', '36866', '236853', '3101271', '239855', '28425',
       '233639', '349201', '349218', '16988', '376566', '3101288',
       '250648', '113773', '335097', '29103', '392096', '345780',
       '349204', '350042', '29108', '363294', '3101272', '2663', '347074',
       '112379', '364850', '8471', '345781', '350047', 'S.O./P.P. 3',
       '2674', '29105', '347078', '383121', '36865', '2687', '113501',
       '6607', '3101312', '374887', '3101265', '12460', '17600', '349203',
       '28213', '17465', '349244', '2685', '2625', '347089', '347063',
       '112050', '347087', '248723', '3474', '28206', '364499', '112058',
       '3101290', '2079', '7075', '315098', '19972', '368323', '367228',
       '2671', '347468', '2223', '17756', '315097', '392092', '11774',
       '3101287', '2683', '315090', '5547', '349213', '347060', '17592',
       '392091', '113055', '2629', '350026', '28134', '17466', '233866',
       '236852', '2149', '17590', '345777', '349248', '695', '345765',
       '2667', '349212', '349217', '349257', '7552', '34068', '392076',
       '211536', '112053', '111369', '370376', '330911', '363272',
       '240276', '315154', '7538', '330972', '2657', '349220', '694',
       '21228', '24065', '233734', '2692', '3101270', '2696', '17368',
       '17598', '2698', '113054', '31029', '13236', '2682', '342712',
       '315087', '345768', '113778', '3101263', '237249', '3101291',
       '17594', '370374', '13695', '2168', '2861', '349230', '348122',
       '349232', '237216', '347090', '334914', '13534', '330963', '2543',
       '382653', '349211', '3101297', '17562', '359306', '11770',
       '248744', '368702', '19924', '349238', '240261', '2660', '330844',
       '31416', '364856', '347072', '345498', '376563', '13905', '350033',
       '3101268', '347471', '3338', '11778', '365235', '347070', '330920',
       '383162', '3410', '248734', '237734', '330968', '17531', '329944',
       '2681', '13050', '367227', '392095', '368783', '350045', '211535',
       '342441', '369943', '113780', '2621', '349226', '350409', '2656',
       '248659', '392083', '23568', '113791', '349255', '3701', '350405',
       '347469', '110489', '3101315', '335432', '220844', '343271',
       '237393', '17591', '17770', '7548', '251', '2670', '233478',
       '7935', '239059', 'S.O./P.P. 2', '48873', '28221', '111163',
       '235509', '347465', '347066', '31030', '65305', '34050', '12998',
       '9232', '28034', '17613', '349250', '3101308', '347091', '113038',
       '330924', '32302', '2148', '342684', '14266', '350053', '17606',
       '350054', '370368', '242963', '113795', '3101266', '330971',
       '350416', '2679', '250650', '112377', '3470', '3101284', '13508',
       '7266', '345775', '42795', '3130', '363611', '28404', '345501',
       '350410', '34644', '349235', '112051', '49867', '39186', '315095',
       '368573', '2676', '14888', '31352', '14260', '315085', '364859',
       '21175', '3101314', '2655', '1478', '17607', '382650', '2652',
       '345771', '349202', '113801', '347467', '347079', '237735',
       '315092', '383123', '112901', '315091', '2658', '1588', '368364',
       '30631', '28004', '350408', '347075', '2654', '244368', '113790',
       '3101309', '236854', '17580', '2684', '349229', '110469', '244360',
       '2675', '2622', '15185', '350403', '348125', '237670', '2688',
       '248726', '13540', '113044', '1222', '368402', '315083', '112378',
       '2147', '28133', '248746', '315152', '29107', '680', '366713',
       '330910', '2159', '349911', '244346', '364858', '30769', '371109',
       '347065', '21332', '17765', '2166', '28666', '334915', '365237',
       '347086', '3236', '3101262', '359309'], dtype=object)

In [ ]:
# Create TicketBatch column: 1 for early, 0 for late
df['TicketBatch'] = np.where(ticket_digits.str.len() < 5 , 1,0)

1: Early<br>
0: Late

Create a boolean column called SharedTicket to indicate if a ticket is shared by more than one passenger.

In [ ]:
# Create SharedTicket column: 1 if ticket is duplicated, else 0
df['SharedTicket'] = np.where(df['Ticket'].duplicated() , 1 , 0)

In [ ]:
# Extract first digit from Ticket (not used further)
first_digit_ticket = df['Ticket'].str.extract(r'([0-9]+)')[0]
first_digit_ticket

0             5
1         17599
2             2
3        113803
4        373450
         ...
1304          5
1305      17758
1306    3101262
1307     359309
1308       2668
Name: 0, Length: 1309, dtype: object

In [ ]:
# Show first 5 Ticket values for inspection
df['Ticket'].head()

0           A/5 21171
1            PC 17599
2    STON/O2. 3101282
3              113803
4              373450
Name: Ticket, dtype: object

In [ ]:
# Drop Ticket column after feature extraction
df.drop('Ticket' , axis = 1 , inplace=True)

In [ ]:
# Show random sample of dataframe to inspect new features
df.sample(10)

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,ind,cell_number,Cabin_letter,Title,FamilySize,Is Alone,Special Agent/route,TicketBatch,SharedTicket
608,609,1.0,2,female,22.000000,1,2,41.5792,C,train,23-25-27,C,Mrs,3,0,SC/Paris,1,1
746,747,0.0,3,male,16.000000,1,1,20.2500,S,train,23-25-27,C,Mr,2,0,CA,1,1
556,557,1.0,1,female,48.000000,1,0,39.6000,C,train,16,A,Lady,1,0,Non-special,0,0
666,667,0.0,2,male,25.000000,0,0,13.0000,S,train,23-25-27,C,Mr,0,1,Non-special,0,0
81,82,1.0,3,male,29.000000,0,0,9.5000,S,train,23-25-27,C,Mr,0,1,Non-special,0,0
219,220,0.0,2,male,30.000000,0,0,10.5000,S,train,23-25-27,C,Mr,0,1,W/C,0,0
1042,1043,NaN,3,male,29.881138,0,0,7.8958,C,test,23-25-27,C,Mr,0,1,Non-special,0,0
1022,1023,NaN,1,male,53.000000,0,0,28.5000,C,test,51,C,Col,0,1,Non-special,0,0
944,945,NaN,1,female,28.000000,3,2,263.0000,S,test,23-25-27,C,Miss,5,0,Non-special,0,1
586,587,0.0,2,male,47.000000,0,0,15.0000,S,train,23-25-27,C,Mr,0,1,Non-special,0,0

In [ ]:
# Show dataframe info to check new columns
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 18 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   PassengerId          1309 non-null   int64
 1   Survived             891 non-null    float64
 2   Pclass               1309 non-null   int64
 3   Sex                  1309 non-null   object
 4   Age                  1309 non-null   float64
 5   SibSp                1309 non-null   int64
 6   Parch                1309 non-null   int64
 7   Fare                 1309 non-null   float64
 8   Embarked             1307 non-null   object
 9   ind                  1309 non-null   object
 10  cell_number          1309 non-null   object
 11  Cabin_letter         1309 non-null   object
 12  Title                1309 non-null   object
 13  FamilySize           1309 non-null   int64
 14  Is Alone             1309 non-null   int64
 15  Special Agent/route  1309 non-null   object
 16  TicketBatch          1309 non-null   int64
 17  SharedTicket         1309 non-null   int64
dtypes: float64(3), int64(8), object(7)
memory usage: 184.2+ KB

In [ ]:
# Save the processed dataframe with new features
df.to_csv('E:\Data science\Titanic dataset\data\Processed data\Data Analysis\processed_data.csv' , index=False)

#### Summary

- Cabin, Name, and Ticket columns have been split into more informative features.
- The processed data is now ready for further analysis or modeling.